---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.GenericFailures
source: html/c30f3f5e-f272-e44d-2c4d-e3f888e86859.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GenericFailures

Generic failures that may apply to any Revit Element

## Syntax (C#)
```csharp
public static class GenericFailures
```